questions = [
    {'price': {
        'keys': ['стоять', 'цена'],
        'responses': [
            'В 2021/22 учебном году для стандартного режима посещения школы себестоимость составляет 123 960 '
            'рублей в месяц, для недельного пансиона — 140 859 рублей в месяц, для полного пансиона 157 769 '
            'рублей в месяц. Подробнее можно узнать здесь - '
            'https://letovo.ru/postuplenie/stoimost-obucheniya-i-finansovaya-podderzhka/']
    }},
    {'summative': {
        'keys': ['самматив'],
        'responses': [
            'Самматив - аналог контрольной. Он проводится по четырем критериям: А - знание и понимание, '
            'В - исселдование и анализ, С - интерпритация и оформление, D - язык и рефлексия. Именно он '
            'определяет итоговую оценку ученика.']
    }},
    {'formative': {
        'keys': ['форматив'],
        'responses': ['Форматив не влияет на итоговую оценку, его можно сравнить с диагностической работой.']
    }},

    {'staff': {
        'keys': ['учитель', 'преподавать', 'преподаватель', 'команда', 'учить'],
        'responses': [
            'В школе с детьми работают настоящие профессионалы. Подробнее об этом можно узнать на сайте школы - '
            'https://letovo.ru/komanda/akademicheskaya-komanda/']
    }},
    {'heads': {
        'keys': ['руководить', 'руководитель', 'глава', 'администрация'],
        'responses': [
            'Директором школы является Мокринский Михаил Генадьевич. Михаил Юрьевич Дмитриев - президент школы, '
            'отвечающий за стратегию школы. Наталия Вениаминовна Любомирская - заместитель директора по '
            'академическим вопросам. Мадлена Львовна Шагинян - директор по инновациям. Дайан Райли - заместитель '
            'директора по управлению пансионом. Владимир Алексеевич Шмелев - заместитель директора по развитию '
            'учащихся. Лариса Анатольевна Корабельщикова - заместитель директора по развитию учащихся. Подробнее '
            'об этом можно узнать на сайте школы - https://letovo.ru/komanda/akademicheskaya-komanda/']
    }},
    {'founder': {
        'keys': ['создатель', 'создатель', 'основать', 'основатель'],
        'responses': [
            'Основателем школы является Вадим Николаевич Мошкович  — российский предприниматель и меценат, '
            'владелец группы компаний «Русагро», окончил знаменитую 57 школу. Подробнее о нем можно узнать на '
            'сайте школы - https://letovo.ru/o-shkole/osnovatel-shkoly/']
    }},
    {'fond': {
        'keys': ['стипендия', 'стипендиальный', 'фонд', 'размер'],
        'responses': [
            'На данный момент размер стипендиального фонда школы составляет 7 миллиардов рублей. Подробнее об '
            'этом можно узнать на сайте школы - '
            'https://letovo.ru/postuplenie/stoimost-obucheniya-i-finansovaya-podderzhka/']
    }},
    {'curriculum': {
        'keys': ['внеакадем'],
        'responses': [
            'В Летово широкая программа по развитию учащихся. В ней содержиться более 100 кружков, клубов, '
            'секций, мастерских и курсов на выбор по пяти программам: творчество и изобретательство, '
            'спорт и здоровье, наука и познание, гражданская и социальная ответственность, лидерство и '
            'взаимодействие. О внеакадемической программе школы можно больше узнать на сайте школы - '
            'https://letovo.ru/obrazovanie/razvitie-uchashchihsya/']
    }},
    {'difference': {
        'keys': ['кружок', 'курс', 'спецкурс', 'клуб'],
        'responses': [
            'Спецкурс - почти как дополнительный предмет с оценкой в конце курса. Курс - спецкурс, но буз оценки '
            'в конце. Кружок - факультативное занятие со свободным посещением. Клуб - специально организованная '
            'группа людей, которая работает на достижение общей цели со встречами по договоренности.']
    }},
    {'initiative': {
        'keys': ['создать', 'свой', 'кружок', 'клуб'],
        'responses': [
            'Да, в школе Летово можно создать свой клуб. Для организации клуба нужно проявить инициативу, '
            'зарегистрировать его, а атакже найти участников. Также можно запросить организацию какого-нибудь '
            'курса у внеакадема, для чего нужно лишь обосновать нужность этого занятия у нас в школе.']
    }},
    {'animals': {
        'keys': ['животное'],
        'responses': [
            'В Летово есть коты, которые периодически появляются на територии школы. В аквариуме школы есть рыбки. В научных классах есть палочники. А также у некоторых работников школы есть свои домашние животные. Однако ученикам животных привозить сюда запрещено из-за возможных аллергий и прочих проблем.']
    }},
    {'food': {
        'keys': ['еда', 'кормить', 'питание'],
        'responses': [
            'В Летово рацион питания продуман специально, чтобы ученики могли получить все необходимые полезные вещества из доступной еды. Подробнее об этом можно узнать на сайте школы - https://letovo.ru/kampus/pitanie/']
    }},
    {'classes': {
        'keys': ['ученик', 'сколько', 'класс', 'группа'],
        'responses': [
            'Классов в привычном понимании этого слова в «Летово» не будет. Каждый ученик выбирает индивидуальную учебную траекторию. За счет этого состав класса и количество учеников будет все время меняться. Минимально в классе будет находиться 8 человек и максимально 24 человека. Количество учеников зависит от предмета и уровня его изучения.']
    }},
    {'program': {
        'keys': ['обучение', 'программа', 'построить', 'построен'],
        'responses': [
            'В центре образовательной модели «Летово» находится ребенок и его предпочтения. Каждый ученик выбирает индивидуальную учебную траекторию и может изучать предметы в разном темпе, в разной последовательности, на разных уровнях (от стандартного до углубленного), самостоятельно или на уроке. Учителя не ограничивают выбор, они корректируют его, обращая внимание детей на новые возможности. Подробнее можно узнать на сайте школы - https://letovo.ru/obrazovanie/obrazovatelnaya-model/']
    }},
    {'dorm': {
        'keys': ['комната', 'сколько', 'бординг', 'дорм'],
        'responses': [
            'Ученики с 7 по 9 класс живут в комнатах по 4 человека. Ученики 10 и 11 класса живут в комнатах по 2 человека. Подробнее о пансионе можно узнать на сайте школы - https://letovo.ru/kampus/o-pansione/ustroystvo-doma/']
    }},
    {'entry': {
        'keys': ['поступать', 'поступить', '1', '2', '3', '4', '5', '6', '10', '11'],
        'responses': [
            'Поступать можно только в 7, 8 и 9 классы. Классов до 7 в школе нет. Поступление в 10 класс возможно только в индивидуальных случаях при выдающихся успехах на олимпиадах. Подробнее можно узнать здесь - https://letovo.ru/postuplenie/o-postuplenii/']
    }},
    {'extraordinary': {
        'keys': ['обычный', 'отличаться', 'государственный'],
        'responses': [
            'Жизнью на территории современного школьного кампуса, где продумано всё до мелочей, в окружении умных '
            'и талантливых сверстников со всей страны; свободой в построении собственной образовательной '
            'траектории, помощью и консультациями по поступлению в лучшие российские и мировые университеты; '
            'возможностью учиться одновременно на русском и английском языках, а также получить диплом '
            'Международного бакалавриата, который поможет поступить в любой университет мира без потери года; '
            'разнообразием программ развития и дополнительного образования, которые позволяют не только '
            'заниматься наукой, спортом и творчеством, но и сформировать умения, необходимые человеку в 21 веке']
    }},
    {'ib': {
        'keys': ['ib'],
        'responses': [
            'Международный бакалавриат (International Baccalaureate, IB) — международная образовательная система, которая готовит выпускников школ к поступлению в лучшие университеты мира и учебе в них. Одной из наиболее отличительных особенностей IB является то, что это не просто аттестат или диплом о квалификации; это многогранный и последовательный подход к образованию, который строится на определенном наборе ценностей, необходимых для воспитания эрудированной, любознательной, мыслящей и неравнодушной молодёжи. Подробнее об этом можно узнать на сайте школы - https://letovo.ru/obrazovanie/mezhdunarodnyj-bakalavriat/']
    }},
    {'profile': {
        'keys': ['профиль', 'направление'],
        'responses': [
            'В «Летово» нет единого профиля обучения. Каждый ученик выбирает индивидуальную учебную траекторию и может изучать предметы в разном темпе, в разной последовательности, на разных уровнях (от стандартного до углубленного), самостоятельно или на уроке. Индивидуальная учебная программа формируется в рамках восьми предметных областей: русский язык, иностранный язык, математика, естественные науки, гуманитарные науки, физическая культура, искусство, компьютерные науки.']
    }},
    {'investigation': {
        'keys': ['научный', 'исследование'],
        'responses': [
            'Часть наших учителей — ученые, которые занимаются исследовательской деятельностью. В школе они будут консультировать учеников по прохождению всех этапов научного исследования. В старших классах наши ученики могут выполнить исследовательский проект на университетском уровне. Также мы предлагаем различные партнерские программы с научными центрами и корпорациями. Для практических занятий и исследований на уроках физики, химии и биологии в «Летово» мы построили 9 лабораторий, оснащенных современным профессиональным оборудованием.']
    }},
    {'requirements': {
        'keys': ['нужно', 'требоваться'],
        'responses': ['Для обучения в школе требуется ноутбук с Windows 10 и телефон Android или iPhone.']
    }},
    {'exchange': {
        'keys': ['программа', 'обмен'],
        'responses': [
            'Мы планируем совместные проекты со школьниками из США, Великобритании, Европы и Азии. Для этого уже сейчас команда «Летово» находится в постоянном контакте с руководителями ряда ведущих зарубежных школ. Для тех учеников, кто заинтересован в поступлении в иностранные вузы, предусмотрена возможность учебы по обмену в одной из международных школ, которая организовывается и оплачивается отдельно.']
    }},
    {'shop': {
        'keys': ['магазин'],
        'responses': [
            'На территории школы нет магазина. В школе есть только кафе, в котором продается еда и некоторые канцелярские и бытовые товары. Также есть опция заказать доставку необходимых товаров прямо в школу.']
    }},
    {'weekend': {
        'keys': ['выходной'],
        'responses': [
            'Свободное время выходных дней ученики проводят за самоподготовкой и отдыхом. Школа регулярно '
            'устраивает экскурсионные поездки и мероприятия для учеников полного пансиона.']
    }},
    {'transport': {
        'keys': ['добраться', 'транспорт'],
        'responses': [
            'Между школой и станциями метро "Филатов луг" и "Теплый стан" каждый день курсируют автобусы.']
    }},
    {'criteria': {
        'keys': ['критерий', 'оценивание', 'оцениваться'],
        'responses': [
            'Оценивание происходит по четырем критериям: А - знание и понимание, В - исселдование и анализ, '
            'С - интерпретация и оформление, D - язык и рефлексия. Именно он определяет итоговую оценку ученика.']
    }},
    {'info': {
        'keys': ['большой', 'информация'],
        'responses': [
            'Больше информации можно найти на сайте школы, а аткже в наших социальных сетях в Facebook, '
            'Instagram и ВКонтакте']
    }},
    {'holidays': {
        'keys': ['открытый', 'каникулы', 'каникул', 'праздник'],
        'responses': [
            'Школа закрывается на каникулы. Ученики, проживающие в пансионе, должны покинуть кампус на период '
            'каникул.']
    }},
    {'meet': {
        'keys': ['познакомиться', 'знакомиться'],
        'responses': [
            'Команда «Летово» проводит Дни открытых дверей, на которых у детей и родителей будет возможность '
            'познакомиться с нашими педагогами лично. Следите за анонсами, которые можно найти на наших страницах '
            'в социальных сетях: ВКонтакте (https://vk.com/letovoschool) и Facebook ('
            'https://www.facebook.com/letovoschool/).']
    }},
    {'parents': {
        'keys': ['родитель'],
        'responses': ['Участие родителей в жизни школы — это то, без чего жизнь на территории кампуса '
                      'представляется невозможной. Школой приветствуются любые предложения от родителей в '
                      'проведении мероприятий. У родителей также всегда есть возможность получить обратный отклик '
                      'от учителей и вместе решить ту или иную проблему, которая возникла у ребенка и требует '
                      'вмешательства взрослых. ']
    }},
    {'tour': {
        'keys': ['экскурсия', 'посетить'],
        'responses': ['Обращаем ваше внимание на то, что школа не проводит индивидуальных экскурсий. Организация '
                      'отдельных экскурсии возможна для групп от 10 человек. Подробнее можно узнать здесь - '
                      'https://letovo.ru/blog-i-novosti/']
    }}
]


def find_response(words):
    count = {list(x.keys())[0]: 0 for x in questions}
    for word in words:
        for i in questions:
            if word in list(i.values())[0]['keys']:
                count[list(i.keys())[0]] += 1
    maxim = max(list(count.values()))
    if maxim == 0:
        return False
    for i, s in count.items():
        if s == maxim:
            return list(filter(lambda x: list(x.keys())[0] == i, questions))[0][i]['responses'][0]



